apps/web/billing/spec/fixtures/vcr_cassettes/Onetime_CLI_BillingPricesCreateCommand/_call/creates_price_with_all_required_arguments.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/products
    body:
      encoding: UTF-8
      string: name=Price+Create+All+Args
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/17.2.0
      Authorization:
      - "<STRIPE_API_KEY>"
      Idempotency-Key:
      - 1766671682-800730e0-278a-4d47-88e5-31a682e696c2
      Stripe-Version:
      - "<STRIPE_VERSION>"
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"17.2.0","lang":"ruby","lang_version":"3.4.7 p58 (2025-10-08)","platform":"arm64-darwin25","engine":"ruby","publisher":"stripe","uname":"Darwin
        Tundra.local 25.3.0 Darwin Kernel Version 25.3.0: Fri Dec  5 23:10:12 PST
        2025; root:xnu-12377.80.260.0.1~42/RELEASE_ARM64_T6020 arm64","hostname":"Tundra.local"}'
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 25 Dec 2025 14:08:03 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '471'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, HEAD, PUT, PATCH, POST, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
        X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Content-Security-Policy:
      - base-uri 'none'; default-src 'none'; form-action 'none'; frame-ancestors 'none';
        img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'; worker-src
        'none'; upgrade-insecure-requests; report-uri https://q.stripe.com/csp-violation?q=dl_LBPlBhTwIKRsGhit0-R6hWnHy92CP4dx5l4yoXKqlJMmS-9UGGqmUsMyqd_ST3nd3fUJee7GjgbeQ
      Idempotency-Key:
      - 1766671682-800730e0-278a-4d47-88e5-31a682e696c2
      Original-Request:
      - req_CK5bjBVVsmicqW
      Stripe-Should-Retry:
      - 'false'
      Stripe-Version:
      - "<STRIPE_VERSION>"
      Vary:
      - Origin
      X-Stripe-Priority-Routing-Enabled:
      - 'true'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
      X-Wc:
      - ABGHIJ
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |-
        {
          "id": "prod_TfaNgjLZLvBKWD",
          "object": "product",
          "active": true,
          "attributes": [],
          "created": 1766671682,
          "default_price": null,
          "description": null,
          "images": [],
          "livemode": false,
          "marketing_features": [],
          "metadata": {},
          "name": "Price Create All Args",
          "package_dimensions": null,
          "shippable": null,
          "statement_descriptor": null,
          "tax_code": null,
          "type": "service",
          "unit_label": null,
          "updated": 1766671682,
          "url": null
        }
  recorded_at: Thu, 25 Dec 2025 14:08:02 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/products/prod_TfaNgjLZLvBKWD
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/17.2.0
      Authorization:
      - "<STRIPE_API_KEY>"
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_CK5bjBVVsmicqW","request_duration_ms":207}}'
      Stripe-Version:
      - "<STRIPE_VERSION>"
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"17.2.0","lang":"ruby","lang_version":"3.4.7 p58 (2025-10-08)","platform":"arm64-darwin25","engine":"ruby","publisher":"stripe","uname":"Darwin
        Tundra.local 25.3.0 Darwin Kernel Version 25.3.0: Fri Dec  5 23:10:12 PST
        2025; root:xnu-12377.80.260.0.1~42/RELEASE_ARM64_T6020 arm64","hostname":"Tundra.local"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 25 Dec 2025 14:08:03 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '471'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, HEAD, PUT, PATCH, POST, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
        X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Content-Security-Policy:
      - base-uri 'none'; default-src 'none'; form-action 'none'; frame-ancestors 'none';
        img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'; worker-src
        'none'; upgrade-insecure-requests; report-uri https://q.stripe.com/csp-violation?q=dl_LBPlBhTwIKRsGhit0-R6hWnHy92CP4dx5l4yoXKqlJMmS-9UGGqmUsMyqd_ST3nd3fUJee7GjgbeQ
      Stripe-Version:
      - "<STRIPE_VERSION>"
      Vary:
      - Origin
      X-Stripe-Priority-Routing-Enabled:
      - 'true'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
      X-Wc:
      - ABGHIJ
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |-
        {
          "id": "prod_TfaNgjLZLvBKWD",
          "object": "product",
          "active": true,
          "attributes": [],
          "created": 1766671682,
          "default_price": null,
          "description": null,
          "images": [],
          "livemode": false,
          "marketing_features": [],
          "metadata": {},
          "name": "Price Create All Args",
          "package_dimensions": null,
          "shippable": null,
          "statement_descriptor": null,
          "tax_code": null,
          "type": "service",
          "unit_label": null,
          "updated": 1766671682,
          "url": null
        }
  recorded_at: Thu, 25 Dec 2025 14:08:03 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/prices
    body:
      encoding: UTF-8
      string: product=prod_TfaNgjLZLvBKWD&unit_amount=900&currency=usd&recurring[interval]=month&recurring[interval_count]=1
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/17.2.0
      Authorization:
      - "<STRIPE_API_KEY>"
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_7MLKTWmQzORtXb","request_duration_ms":110}}'
      Stripe-Version:
      - "<STRIPE_VERSION>"
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"17.2.0","lang":"ruby","lang_version":"3.4.7 p58 (2025-10-08)","platform":"arm64-darwin25","engine":"ruby","publisher":"stripe","uname":"Darwin
        Tundra.local 25.3.0 Darwin Kernel Version 25.3.0: Fri Dec  5 23:10:12 PST
        2025; root:xnu-12377.80.260.0.1~42/RELEASE_ARM64_T6020 arm64","hostname":"Tundra.local"}'
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 25 Dec 2025 14:08:03 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '621'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, HEAD, PUT, PATCH, POST, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
        X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Content-Security-Policy:
      - base-uri 'none'; default-src 'none'; form-action 'none'; frame-ancestors 'none';
        img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'; worker-src
        'none'; upgrade-insecure-requests; report-uri https://q.stripe.com/csp-violation?q=dl_LBPlBhTwIKRsGhit0-R6hWnHy92CP4dx5l4yoXKqlJMmS-9UGGqmUsMyqd_ST3nd3fUJee7GjgbeQ
      Idempotency-Key:
      - 389c8fb3-3515-4943-ba0c-9154a88c3ebc
      Original-Request:
      - req_T9m7JuvwYsEtCw
      Stripe-Should-Retry:
      - 'false'
      Stripe-Version:
      - "<STRIPE_VERSION>"
      Vary:
      - Origin
      X-Stripe-Priority-Routing-Enabled:
      - 'true'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
      X-Wc:
      - ABGHIJ
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |-
        {
          "id": "price_1SiFCxH54PcLeqtYu2cfdRTI",
          "object": "price",
          "active": true,
          "billing_scheme": "per_unit",
          "created": 1766671683,
          "currency": "usd",
          "custom_unit_amount": null,
          "livemode": false,
          "lookup_key": null,
          "metadata": {},
          "nickname": null,
          "product": "prod_TfaNgjLZLvBKWD",
          "recurring": {
            "interval": "month",
            "interval_count": 1,
            "meter": null,
            "trial_period_days": null,
            "usage_type": "licensed"
          },
          "tax_behavior": "unspecified",
          "tiers_mode": null,
          "transform_quantity": null,
          "type": "recurring",
          "unit_amount": 900,
          "unit_amount_decimal": "900"
        }
  recorded_at: Thu, 25 Dec 2025 14:08:03 GMT
- request:
    method: delete
    uri: https://api.stripe.com/v1/products/prod_TfaNgjLZLvBKWD
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/17.2.0
      Authorization:
      - "<STRIPE_API_KEY>"
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_T9m7JuvwYsEtCw","request_duration_ms":190}}'
      Stripe-Version:
      - "<STRIPE_VERSION>"
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"17.2.0","lang":"ruby","lang_version":"3.4.7 p58 (2025-10-08)","platform":"arm64-darwin25","engine":"ruby","publisher":"stripe","uname":"Darwin
        Tundra.local 25.3.0 Darwin Kernel Version 25.3.0: Fri Dec  5 23:10:12 PST
        2025; root:xnu-12377.80.260.0.1~42/RELEASE_ARM64_T6020 arm64","hostname":"Tundra.local"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 400
      message: Bad Request
    headers:
      Server:
      - nginx
      Date:
      - Thu, 25 Dec 2025 14:08:03 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '251'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, HEAD, PUT, PATCH, POST, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
        X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Content-Security-Policy:
      - base-uri 'none'; default-src 'none'; form-action 'none'; frame-ancestors 'none';
        img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'; worker-src
        'none'; upgrade-insecure-requests; report-uri https://q.stripe.com/csp-violation?q=dl_LBPlBhTwIKRsGhit0-R6hWnHy92CP4dx5l4yoXKqlJMmS-9UGGqmUsMyqd_ST3nd3fUJee7GjgbeQ
      Stripe-Version:
      - "<STRIPE_VERSION>"
      Vary:
      - Origin
      X-Stripe-Priority-Routing-Enabled:
      - 'true'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
      X-Wc:
      - ABGHIJ
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "error": {
            "message": "This product cannot be deleted because it has one or more user-created prices.",
            "request_log_url": "https://dashboard.stripe.com/test/logs/req_KRVQjmEelGiCCr?t=1766671683",
            "type": "invalid_request_error"
          }
        }
  recorded_at: Thu, 25 Dec 2025 14:08:03 GMT
recorded_with: VCR 6.3.1
